Revit 2026 API

# OutlineIntersects Method

---

Determine if this Outline intersects the input Outline to within a specified tolerance.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool Intersects(
	Outline outline,
	double tolerance
)
```
```vb
Public Function Intersects (
	outline As Outline,
	tolerance As Double
) As Boolean
```
```cpp
public:
bool Intersects(
	Outline^ outline,
	double tolerance
)
```
```fsharp
member Intersects :
        outline : Outline *
        tolerance : float -> bool
```

#### Parameters

outline Outline
     The outline to test for intersection with this one.
tolerance Double
     The tolerance to use when determining intersection. Defaults to zero.

#### Return Value

Boolean True if the given outline intersects this outline.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

If the tolerance is positive, the outlines may be separated by the tolerance distance in each coordinate. If the tolerance is negative, the outlines must overlap by at least the tolerance distance in each coordinate.

#### Reference

Outline Class

Autodesk.Revit.DB Namespace